---
type: GeomCombinationSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# GeomCombinationSet

`Autodesk.Revit.DB.GeomCombinationSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | GeomCombinationSet | — | `public GeomCombinationSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( GeomCombination item )` |
| Method | Erase | — | `public virtual int Erase ( GeomCombination item )` |
| Method | ForwardIterator | — | `public virtual GeomCombinationSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( GeomCombination item )` |
| Method | ReverseIterator | — | `public virtual GeomCombinationSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |